# SQL - Structured Query Language

## O que é SQL?

> _Structured Query Language_ (__SQL__) é a linguagem padrão usada para escrever consultas em um banco de dados. Foi aprovado pela ISO (_International Standard Organization_) e ANSI (_American National Standards Institute_)

Como é de conhecimento geral, SQL é uma linguagem de consulta estruturada e declarativa utilizada para acessarmos informações num __banco de dados relacionais__, popularmente ou carinhosamente chamada de _linguagem de banco de dados relacionais_.

> _**Linguagem de Consulta Estruturada**_

Assim, podemos realizar certas operações em __banco de dados__ existentes ou criar um __banco de dados__ e suas _tabelas_. 

Os comandos SQL são agrupados em 5 categorias, como a seguir:

* __DDL__ : Data Definition Language
* __DML__ : Data Manipulation Language
* __TCL__ : Transaction Control Language
* __DQL__ : Data Query Language
* __DCL__ : Data Control Language

Veremos o detalhamento de cada uma destas categorias na seção abaxio.

## As categorias do SQL

![comandos_sql.png]()

### DDL

#### Data Definition Language

Consiste em comandos SQL que são usados para definirmos o _schema_ (esquema) do banco de dados.

Simplesmente lida com as descrições do esquema do banco de dados, sendo usada para criar e modificar a estrutura dos objetos do banco de dados.

Assim, __DDL__ é um conjunto de comandos SQL para criar, modificar e apagar estruturas de banco de dados, mas não os dados. Estes comandos são normalmente não são usados por um usuário geral, que deve acessar o banco de dados por meio de um aplicativo (cliente de banco de dados).

Lista dos comandos:

* __CREATE__ : usado para criar banco de dados e seus objetos (tabelas, index, funções, visões, _store procedure_ e _triggers_)

* __DROP__ : usado para remover objetos do banco de dados

* __ALTER__ : usado para alterar a estrutura do banco de dados

* __TRUNCATE__ : usado para remover todos os registros de uma tabela, incluindo todos os espaços alocados para os registros

* __COMMENT__ : usado para adicionar comentários ao dicionário de dados

* __RENAME__ : usado para renomear objetos existentes no banco de dados

#### CREATE

Existem duas instruções CREATE disponíveis no SQL:

* CREATE DATABASE
* CREATE TABLE

<u>CREATE DATABASE</u>

Um banco de dados é definido como um conjunto estruturado de dados. 

Assim, no SQL, o primeiro passo para armazenar os dados de maneira bem estruturada é criar um banco de dados. 

A instrução __CREATE DATABASE__ é usada para criar um novo banco de dados em SQL.

__Sintaxe__

```
CREATE DATABASE [IF NOT EXISTS] nome_database;
```

__ATENÇÃO__ : nome_database é o nome do banco de dados que se deseja criar

__EX__:

```
CREATE DATABASE IF NOT EXISTS INFINITY;

USE INFINITY;
```

<u>CREATE TABLE</u>

Aprendemos logo acima sobre a criação de bancos de dados. 

Agora, para armazenar os dados, precisamos de uma tabela para fazer isso. 

A instrução __CREATE TABLE__ é usada para criar uma tabela em SQL. 

Sabemos que uma tabela é composta por linhas e colunas. Então, ao criar tabelas, temos que fornecer todas as informações ao SQL sobre os nomes das colunas, tipo de dados a serem armazenados nas colunas, tamanho dos dados etc.

__Sintaxe__

```
CREATE TABLE [IF NOT EXISTS] nome_tabela(
  coluna1 tipo_dado(tamanho),
  coluna2 tipo_dado(tamanho),
  coluna3 tipo_dado(tamanho)
);
```
__EX__:

```
CREATE TABLE IF NOT EXISTS STUDENTS(
  REGISTRATION INT(5) NOT NULL PRIMARY KEY,
  NAME VARCHAR(30),
  EMAIL VARCHAR(50)
);
```

Essa consulta criará uma tabela chamada STUDENTS. 

O campo REGISTRATION é do tipo __int__ e pode armazenar um número inteiro de tamanho 5. 

Já os campos NAME e EMAIL são do tipo __varchar__ e podem armazenar caracteres com tamanho máximo de 30 e 50 caracteres, respectivamente.

#### DROP

DROP é usado para excluir um banco de dados inteiro ou apenas uma tabela. 

A instrução DROP destrói os objetos como um banco de dados, tabela, índice ou visão.

Uma instrução DROP em SQL remove um componente de um sistema de gerenciamento de banco de dados relacional (RDBMS).

__Sintaxe__

```
DROP OBJECT [IF EXISTS] nome_objeto;
```

__EX__:

```
DROP TABLE [IF EXISTS] STUDENTS;

DROP DATABASE [IF EXISTS] INFINITY;
```

#### TRUNCATE

A instrução TRUNCATE que é usada para remover os dados de uma tabela para fins de desalocação (vazia para reutilização). 

O resultado dessa operação remove rapidamente todos os dados de uma tabela, geralmente ignorando vários mecanismos de imposição de integridade. 

Foi introduzido oficialmente no SQL ANSI 2008.

> A instrução mytable TRUNCATE TABLE é logicamente (embora não fisicamente) equivalente à instrução DELETE FROM mytable (sem uma cláusula WHERE).

__Sintaxe__

```
TRUNCATE TABLE nome_tabela;
```

__EX__: 

```
TRUNCATE TABLE STUDENTS;
```

__OBS__ : Após executar a consulta acima, a tabela STUDENTS será truncada, ou seja, os dados serão excluídos, mas a estrutura permanecerá na memória para operações posteriores

__DROP vs TRUNCATE__

* Truncar é normalmente ultrarrápido e é ideal para excluir dados de uma tabela temporária

* Truncar preserva a estrutura da tabela para uso futuro, ao contrário de drop table onde a tabela é excluída com sua estrutura completa

* A exclusão de tabela ou banco de dados usando a instrução DROP não pode ser revertida, portanto, deve ser usada com __sabedoria__

#### ALTER

ALTER TABLE é usado para _adicionar_, _excluir_/_descartar_ ou _modificar_ colunas na tabela existente. 

Também é usado para adicionar e descartar várias restrições na tabela existente.

##### ADD

ADD é usado para adicionar colunas à tabela existente. 

Às vezes precisamos realizar a adição de informações adicionais, nesse caso não precisamos criar todo o banco de dados novamente, o ADD vem em nosso socorro!

__Sintaxe__

```
ALTER TABLE nome_tabela ADD (
  nova_coluna1 tipo_dado(tamanho),
  nova_coluna2 tipo_dado(tamanho),
)
```

__EX__:

```
ALTER TABLE STUDENTS ADD(
  PHONE VARCHAR(9),
  COURSE VARCHAR(40)
);
```

##### DROP

DROP COLUMN é usado para descartar colunas em uma tabela. Excluindo as colunas indesejadas da tabela.

__Sintaxe__

```
ALTER TABLE nome_tabela DROP COLUMN nome_coluna;
```

__EX__:

```
ALTER TABLE STUDENTS DROP COLUMN COURSE;
```

##### MODIFY

Ele é usado para modificar as colunas existentes em uma tabela. Várias colunas também podem ser modificadas de uma só vez.

__Sintaxe__

```
ALTER TABLE nome_tabela MODIFY nome_coluna tipo_coluna;
```

__EX__:

```
ALTER TABLE STUDENTS MODIFY PHONE VARCHAR(11);
```

#### COMMENT

Como qualquer linguagem de programação, os comentários também importam muito no SQL. 

Veremos abaixo como escrever comentários em qualquer trecho de SQL.

Os comentários podem ser escritos nestes três formatos:

* Comentários de linha única

* Comentários de várias linhas

* Comentários de linha

##### Comentários de linha única

São comentários que começam e terminam em uma única linha.

A linha que começa com ‘–‘ é um comentário e não será executada.

__Sintaxe__

```
-- este é um comentário de linha única
-- outro exemplo de comentário
SELECT * FROM STUDENTS;
```

##### Comentários de várias linhas

São comentários que começam em uma linha e terminam em outra linha. 

A linha que começa com '/*' é considerada como ponto de partida do comentário e termina quando '*/' é encontrado.

__Sintaxe__

```
/* Este é um comentário
de várias linhas */
SELECT * FROM STUDENTS;
```

##### Comentários de linha

São uma extensão de comentários de várias linhas, os comentários podem ser declarados entre as instruções e estão entre '/*' e '*/'.

__Sintaxe__

```
SELECT * FROM STUDENTS; /* veremos sobre a instrução SELECT nas próximas seções */
```

#### RENAME

Às vezes, podemos querer renomear nossa tabela para dar um nome mais relevante. 

Para isso, podemos usar ALTER TABLE para renomear o nome da tabela.

__Sintaxe__

_Para os SGBDs Oracle e MySQL_

```
ALTER TABLE nome_tabela RENAME TO novo_nome_table;
```

```
ALTER TABLE nome_tabela RENAME COLUMN nome_antigo TO nome_novo;
```

_Para o SGBD - MariaDB_

```
ALTER TABLE nome_tabela CHANGE nome_antigo nome_novo tipo_dado;
```

__EX__:

```
ALTER TABLE STUDENTS RENAME TO STUDENTS_DETAILS;
```

```
ALTER TABLE STUDENTS RENAME COLUMN COURSE TO TI_COURSE;
``` 

```
ALTER TABLE STUDENTS CHANGE COURSE TI_COURSE VARCHAR(40);
```

### DML

#### Data Manipulation Language

São comandos SQL que lidam com a manipulação dos dados presentes no banco de dados e pertencem a esta categoria. 

É nesta categoria que encontramos a maioria das instruções SQL. 

Basicamente, as instruções DCL - _Data Control Language_ - são agrupadas com instruções DML - _Data Manipulation Language_.

Lista dos comandos:

* __INSERT__ : usado para inserir dados numa tabela

* __UPDATE__ : usado para atualizar dados dentro de uma tabela

* __DELETE__ : usado para remover registros de uma tabela

#### INSERT

A instrução INSERT INTO do SQL é usada para inserir uma nova linha em uma tabela. 

Existem duas maneiras de usar a instrução INSERT INTO para inserir linhas:

##### __Somente valores__

O primeiro método é especificar apenas o valor dos dados a serem inseridos sem os nomes das colunas.

__Sintaxe__

```
INSERT INTO nome_tabela VALUES (valor1, valor2, valor3);
```

##### Nomes e valores das colunas

No segundo método, especificaremos as colunas que queremos preencher e seus valores correspondentes, conforme mostrado abaixo:

__Sintaxe__

```
INSERT INTO nome_tabela (coluna1, coluna2, coluna3) 
  VALUES (valor1, valor2, valor3);
```

_Inserindo várias linhas_

```
INSERT INTO nome_tabela (coluna1, coluna2, coluna3) 
  VALUES (valor1, valor2, valor3),
         (valor4, valor5, valor6),
         (valor7, valor8, valor9);
```

#### UPDATE

A instrução UPDATE em SQL é utilizada para atualizar os dados de uma tabela existente no banco de dados. 

Podemos atualizar colunas únicas e várias colunas usando a instrução UPDATE conforme a demanda.

__Sintaxe__

```
UPDATE nome_tabela SET coluna1 = valor1, coluna2 = valor2 WHERE condição;
``` 

__EX__:

```
UPDATE STUDENTS SET NAME = 'Amanda Guyer' WHERE REGISTRATION = 12345;
```

_Atualizando várias colunas_

```
UPDATE STUDENTS SET
  NAME = 'Amanda Guyer',
  EMAIL = 'amanda@email.com'
WHERE
  REGISTRATION = 12345;
```

__ATENÇÃO!!!__

> Se não usar a cláusula WHERE todos os registros serão atualizados com o valor informado

```
UPDATE STUDENTS SET NAME = 'Amanda';
```

#### DELETE

A instrução DELETE em SQL é usada para excluir registros existentes de uma tabela. 

Podemos excluir um único registro ou vários registros dependendo da condição que especificamos na cláusula WHERE.

__Sintaxe__

```
DELETE FROM nome_tabela WHERE condição;
```

__ATENÇÃO__: _podemos excluir registros únicos e/ou múltiplos, dependendo da condição que fornecemos na cláusula WHERE. Se omitirmos a cláusula WHERE, todos os registros serão excluídos e a tabela ficará vazia_

__EX__:

```
DELETE FROM STUDENTS WHERE NAME = 'Amanda';
```

_Removendo todos os registos_

```
DELETE FROM STUDENTS;

DELETE * FROM STUDENTS;
```

__IMPORTANTE__: DELETE é um comando DML (_Data Manipulation Language_), portanto, a operação executada por DELETE pode ser revertida ou desfeita

### TCL

#### Transaction Control Language

Considerada, por muitos, como uma outra categoria de cláusulas SQL, TCL - _Transaction Control Language_ - concentra instruções que lidam com a transação dentro do banco de dados.

Lista dos comandos:

* __COMMIT__ : confirma uma transação

* __ROLLBACK__ : reverte uma transação caso ocorra algum erro

* __SET TRANSACTION__ : especifica as características da transação

### DQL

#### Data Query Language

As instruções DQL - _Data Query Language_ - são usadas para realizar consultas nos dados em objetos de esquema (_schema_). 

> A finalidade do comando DQL é obter alguma relação de esquema com base na consulta passada a ele. 

Assim, podemos definir DQL da seguinte forma: _é um componente da instrução SQL que permite obter dados do banco de dados e impor ordem a ele_. 

Isto inclui a, famosa, instrução SELECT. Este comando permite retirar os dados do banco de dados para realizar operações com ele. 

Quando um SELECT é disparado contra uma tabela ou tabelas, o resultado é compilado em outra tabela temporária, que é exibida ou talvez recebida pelo programa, ou seja, um front-end.

Lista de comandos:

* __SELECT__ : usado para recuperar dados de um banco de dados

#### SELECT

É a instrução mais usada em SQL!

A instrução SELECT em SQL é usada para recuperar ou buscar dados de um banco de dados. 

Podemos buscar a tabela inteira ou de acordo com algumas regras especificadas. 

Os dados retornados são armazenados em uma tabela de resultados. Essa tabela de resultados também é chamada de conjunto de resultados.

Com a cláusula SELECT de uma instrução de comando SELECT, especificamos as colunas que queremos que sejam exibidas no resultado da consulta e, opcionalmente, quais cabeçalhos de coluna preferimos ver acima da tabela de resultados.

A cláusula SELECT é a primeira cláusula e é uma das últimas cláusulas da instrução SELECT que o servidor de banco de dados avalia. 

A razão para isso é que antes de podermos determinar o que incluir no conjunto de resultados final, precisamos conhecer todas as colunas possíveis que podem ser incluídas no conjunto de resultados final.

__Sintaxe__

```
SELECT coluna1, coluna2 FROM nome_tabela;
```

_Selecionando a tabela inteira_

```
SELECT * FROM nome_tabela;
```

__EX__:

```
SELECT REGISTRATION, NAME FROM STUDENTS;
```

### DCL

#### Data Control Language

DCL - _Data Control Language_ - inclui comandos como __GRANT__ e __REVOKE__ que lidam principalmente com os direitos, permissões e outros controles do sistema de banco de dados.

Lista dos comandos:

* __GRANT__: dá aos usuários privilégios de acesso ao banco de dados

* __REVOKE__: retira os privilégios de acesso do usuário concedidos pelo comando GRANT

## Cláusulas

### FROM

A cláusula __FROM__ é usado para especificar de qual tabela selecionar ou excluir dados.

__Sintaxe__

```
SELECT * FROM TABELA;
```

### WHERE

A cláusula __WHERE__ filtra um conjunto de resultados para incluir apenas os registros que atendem a uma condição especificada.

__Sintaxe__

```
SELECT * FROM TABELA WHERE CONDIÇÃO;
```

### ORDER BY

A cláusula __ORDER BY__ é usada para classificar o conjunto de resultados em ordem crescente ou decrescente.

A cláusula __ORDER BY__ classifica o conjunto de resultados em ordem crescente por padrão. 

Para classificar os registros em ordem decrescente, use a palavra-chave DESC.

__Sintaxe__

```
SELECT * FROM TABELA ORDER BY COLUNA;
```

#### ASC

O comando _ASC_ é usado para classificar os dados retornados em ordem crescente

```
SELECT * FROM TABELA ORDER BY COLUNA ASC;
```

#### DESC

O comando _DESC_ é usado para classificar os dados retornados em ordem decrescente

```
SELECT * FROM TABELA ORBER BY COLUNA DESC;
```

### IN

O operador IN é um operador de associação que retorna valores que correspondem aos valores em uma lista ou subconsulta. 

> Podemos especificar vários valores em uma cláusula WHERE. 

Este operador compara um valor com um conjunto de valores e retorna um verdadeiro se o valor pertence a esse conjunto, senão retornará falso. 

__VALE LEMBRAR__ : É uma abreviação para várias condições __OR__.

__SINTAXE__

```
SELECT * FROM TABELA WHERE COLUNA IN (VALORES);

SELECT COLUNA1, COLUNA2 FROM TABELA WHERE COLUNA IN (VALORES);
``` 

__EXEMPLO__

```
SELECT NAME, AGE FROM STUDENTS_DETAILS 
WHERE AGE = 18 OR AGE = 21 OR AGE = 25;

SELECT NAME, AGE FROM STUDENTS_DETAILS
WHERE AGE IN (18, 21, 25);

SELECT * FROM STUDENTS_DETAILS WHERE STATE = 'RJ' OR STATE = 'SP';
SELECT * FROM STUDENTS_DETAILS WHERE STATE IN ('RJ', 'SP');
```

### NOT IN

Se temos o operador __IN__, podemos pensar que, também, teremos o operador __NOT IN__? 

__Sim!!!__

Este operador, basicamente, nega ou faz o inverso do operador __IN__ que vimos acima

__SINTAXE__

```
SELECT * FROM TABELA WHERE COLUNA NOT IN (VALORES);

SELECT COLUNA1, COLUNA2 FROM TABELA WHERE COLUNA NOT IN (VALORES);
``` 

__EXEMPLO__

```
SELECT NAME, AGE FROM STUDENTS_DETAILS 
WHERE AGE <> 18 OR AGE <> 21 OR AGE <> 25;

SELECT NAME, AGE FROM STUDENTS_DETAILS
WHERE AGE NOT IN (18, 21, 25);

SELECT * FROM STUDENTS_DETAILS WHERE STATE <> 'RJ' OR STATE <> 'SP';
SELECT * FROM STUDENTS_DETAILS WHERE STATE NOT IN ('RJ', 'SP');
```

### BETWEEN

Se desejarmos selecionar os registros dentro de um intervalo, como por exemplo, todos os alunos com idade entre 15 e 25 anos, podemos utilizar a cláusula `BETWEEN`.

**SINTAXE**

```SELECT * FROM TABELA WHERE COLUNA BETWEEN VALOR1 AND VALOR2;```

**EXEMPLO**

```
SELECT * FROM STUDENTS_DETAILS 
WHERE AGE BETWEEN 15 AND 25;
```

**OBS**: Lembre-se que os valores 15 e 25 são incluídos, ou seja, se houver algum aluno com essas idades, o registro será retornado no `SELECT`

### LIKE

Às vezes, podemos selecionar _tuplas_ ou _regitros_ do __banco de dados__ que correspondam a determinados padrões. 

Como querer recuperar todas as colunas onde as _tuplas_ ou _registros_ começam com determinada letra, ou começam com uma letra específica e terminam com outra letra, ou padrões de string ainda mais complexos e restritivos. 

Para estes casos, temos a cláusula `LIKE` que vem para resgatar estes registros com base num padrão e, geralmente, está associada à cláusula `WHERE`.

Existem dois tipos de _curingas_ usados para filtrar os resultados:

* __`%`__ : usado para corresponder a zero ou mais caracteres
* `_` : usado para corresponder exatamente a um caractere

__SINTAXE__

```
SELECT * FROM TABELA WHERE COLUNA LIKE 'PADRÃO';
```

__EXEMPLO__

```
-- Retorna todos os nomes iniciados com a letra R
SELECT * FROM STUDENTS_DETAILS WHERE NAME LIKE 'R%';

-- Retorna todos os nomes que possuam qualquer letra entre das letras A
SELECT NAME FROM STUDENTS_DETAILS WHERE NAME LIKE '%A_A%';

-- Retorno todos os nomes que terminam com a letra O
SELECT NAME FROM STUDENTS_DETAILS WHERE NAME LIKE '%o';

-- Retorna todos os nomes onde a terceira letra é F
SELECT NAME FROM STUDENTS_DETAILS WHERE NAME LIKE '__f%';
```

## Funções de Agregação

### AVG

Calcula a média aritmética dos valores em uma única coluna. 

__Sintaxe__

```
SELECT AVG(AGE) AS 'MEAN OF AGES' FROM STUDENTS_DETAILS;
```

__No MariaDB__ 
```
SELECT CAST(AVG(AGE) AS INT) AS 'MEAN OF AGES' FROM STUDENTS_DETAILS;
```

__No MySQL__
```
SELECT CAST(FLOOR(AVG(AGE)) AS SIGNED) AS 'MEAN OF AGES' FROM STUDENTS_DETAILS;
```

### COUNT

Retorna o total de linhas selecionadas. 

Ela pode receber por parâmetro o nome da coluna ou um asterisco. 

__ATENÇÃO__ : _Por padrão, quando informado o nome de uma coluna, valores do tipo null são ignorados, mas quando informado * todas as linhas serão contabilizadas_

__Sintaxe__

```
SELECT COUNT(*) FROM STUDENTS_DETAILS;

SELECT COUNT(AGE) FROM STUDENTS_DETAILS;

SELECT COUNT(AGE) FROM STUDENTS WHERE AGE > 21;
```

### SUM

Realiza a soma dos valores em uma única coluna e retorna esse resultado.

__Sintaxe__

```
SELECT SUM(FEE) AS 'TOTAL RECEIVABLE [ R$ ]' FROM STUDENTS_DETAILS;

SELECT SUM(FEE) AS 'AMOUNT TO BE RECEIVE [ R$ ]' FROM STUDENTS_DETAILS;
```

### MAX

Analisa um conjunto de valores e retorna o maior entre eles

__Sintaxe__

```
SELECT MAX(AGE) FROM STUDENTS_DETAILS;

SELECT * FROM STUDENTS 
WHERE AGE = (SELECT MAX(AGE) FROM STUDENTS_DETAILS);
```

### MIN

Analisa um grupo de valores e retorna o menor entre eles

__Sintaxe__

```
SELECT MIN(AGE) FROM STUDENTS_DETAILS;

SELECT * FROM STUDENTS 
WHERE AGE = (SELECT MIN(AGE) FROM STUDENTS_DETAILS);
```

> SELECT MAX(AGE), MIN(AGE) FROM STUDENTS;

## Operadores lógicos

### AND

O comando __AND__ é usado com WHERE para incluir somente linhas onde ambas as condições são verdadeiras

```
SELECT * FROM TABELA WHERE COLUNA1 = 'VALOR1' AND COLUNA2 = 'VALOR2';
```

### OR

O comando __OR__ é usado com WHERE para incluir linhas onde uma das condições é verdadeira

```
SELECT * FROM TABELA WHERE COLUNA1 = 'VALOR1' OR COLUNA1 = 'VALOR2';
```

### NOT

O comando __NOT__ é usado com WHERE para incluir apenas linhas onde uma condição não é verdadeira

```
SELECT * FROM TABELA WHERE NOT COLUNA1 = 'VALOR1';
```

## Operadores Relacionais

Podemos utilizar os operadores relacionais juntamente com a cláusula WHERE para filtrarmos dados em nossas tabelas

* __<__ : menor
* __>__ : maior
* __<=__ : menor ou igual
* __>=__ : maior ou igual
* __=__ : igual
* __<>__ : diferente

```
SELECT * FROM COURSES WHERE TIME < 10;
```